{
  "what is dna": {
    "source": "qa",
    "text": "Main Answer (Qa):\nDeoxyribonucleic acid (; DNA) is a polymer composed of two polynucleotide chains that coil around each other to form a double helix. The polymer carries genetic instructions for the development, functioning, growth and reproduction of all known organisms and many viruses.",
    "confidence": 0.9,
    "meta": {
      "candidates": [
        [
          "qa",
          0.8
        ]
      ],
      "best_source": "qa"
    }
  },
  "what is gravity": {
    "source": "qa",
    "text": "Main Answer (Qa):\nIn physics, gravity (from Latin  gravitas 'weight'), also known as gravitation or a gravitational interaction, is a fundamental interaction, which may be described as the effect of a field that is generated by a gravitational source such as mass.\nThe gravitational attraction between clouds of primordial hydrogen and clumps of dark matter in the early universe caused the hydrogen gas to coalesce, eventually condensing and fusing to form stars.",
    "confidence": 0.9,
    "meta": {
      "candidates": [
        [
          "qa",
          0.8
        ]
      ],
      "best_source": "qa"
    }
  },
  "what is a blackhole": {
    "source": "qa",
    "text": "Main Answer (Qa):\nIn networking, a black hole refers to a place in the network where incoming or outgoing traffic is discarded (or \"dropped\" or sinkholed) without informing the source that the data did not reach its intended recipient.\nWhen examining the topology of the network, the black holes themselves are invisible, and can only be detected by monitoring the lost traffic.",
    "confidence": 0.9,
    "meta": {
      "candidates": [
        [
          "qa",
          0.8
        ]
      ],
      "best_source": "qa"
    }
  },
  "who is gandhi": {
    "source": "Wikipedia",
    "text": "Mohandas Karamchand Gandhi (2 October 1869 – 30 January 1948) was an Indian lawyer, anti-colonial activist, and political ethicist who employed nonviolent resistance to lead the successful campaign for India's independence from British rule. He inspired movements for civil rights and freedom across the world. The honorific Mahātmā (from Sanskrit, meaning great-souled, or venerable), first applied to him in South Africa in 1914, is used worldwide.",
    "confidence": 0.9,
    "meta": {}
  },
  "how old is this universe": {
    "source": "Wikipedia",
    "text": "Miss Universe 2025 will be the 74th Miss Universe pageant, scheduled to be held at the Impact Challenger Hall in Pak Kret, Nonthaburi, Thailand, on 21 November 2025.\nVictoria Theilvig of Denmark will crown her successor at the conclusion of the event.\n\n\n== Background ==\n\n\n=== Location and date ===\nOn 16 November 2024, at Miss Universe 2024, pageant co-owner Raúl Rocha Cantú announced that the shortlisted host cities for the 74th edition of the pageant were in Argentina, Costa Rica, Dominican Republic, Morocco, India, South Africa, Spain, and Thailand.",
    "confidence": 0.9,
    "meta": {}
  },
  "who invented gravity": {
    "source": "Wikipedia",
    "text": "The invention of radio communication was preceded by many decades of establishing theoretical underpinnings, discovery and experimental investigation of radio waves, and engineering and technical developments related to their transmission and detection. These developments allowed Guglielmo Marconi to turn radio waves into a wireless communication system.\nThe idea that the wires needed for electrical telegraph could be eliminated, creating a wireless telegraph, had been around for a while before the establishment of radio-based communication.",
    "confidence": 0.9,
    "meta": {}
  },
  "who was netaji": {
    "source": "Wikipedia",
    "text": "Bhagwanji, also known as Gumnami Baba (lit. 'Baba with no name'), was an ascetic who lived approximately the last thirty years of his life in various parts of Uttar Pradesh, India. He is best known for being the object of unfounded rumors that asserted his real identity as being Subhas Chandra Bose. These claims have repeatedly been found to be unsubstantiated by numerous investigations.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "who was adolf hitler": {
    "source": "Wikipedia",
    "text": "The Hitler family consists of the relatives and ancestors of Adolf Hitler. The family has long been of interest to historians and genealogists because of the biological uncertainty of Hitler's paternal grandfather, as well as the family's inter-relationships and their psychological effect on Hitler during his childhood and later life.\nAlois Schicklgruber (Adolf's father) changed his surname on 7 January 1877 to \"Hitler\" (derived from that of his deceased stepfather, Johann Georg Hiedler), which was the only form of the last name that his son Adolf used.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "what is a rainbow": {
    "source": "Wikipedia",
    "text": "\"Somewhere Over the Rainbow/What a Wonderful World\" (also known as \"Over the Rainbow/What a Wonderful World\") is a medley of \"Over the Rainbow\" by Judy Garland and \"What a Wonderful World\" by Louis Armstrong, recorded by Hawaiian singer Israel Kamakawiwoʻole. First released on the 1990 album Ka ʻAnoʻi, an acoustic rendition of the medley became notable after its release on his 1993 album Facing Future. The cut version — Over the Rainbow — was released in 2001 on the posthumous album Alone In Iz World.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "what is a dna": {
    "source": "Wikipedia",
    "text": "Deoxyribonucleic acid (; DNA) is a polymer composed of two polynucleotide chains that coil around each other to form a double helix. The polymer carries genetic instructions for the development, functioning, growth and reproduction of all known organisms and many viruses. DNA and ribonucleic acid (RNA) are nucleic acids.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "what is a black hole": {
    "source": "Wikipedia",
    "text": "A black hole is an astronomical body so dense that its gravity prevents anything from escaping, even light. Albert Einstein's theory of general relativity predicts that a sufficiently compact mass will form a black hole. The boundary of no escape is called the event horizon.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "what is yetti": {
    "source": "qa",
    "text": "Main Answer (Qa):\nThe Yeti () is an ape-like creature purported to inhabit the Himalayan mountain range in Asia. In Western popular culture, the creature is commonly referred to as the Abominable Snowman.",
    "confidence": 0.9,
    "meta": {
      "candidates": [
        [
          "qa",
          0.8
        ]
      ],
      "best_source": "qa"
    },
    "sources": {
      "qa": true
    }
  },
  "what is bunip": {
    "source": "qa",
    "text": "Main Answer (Qa):\nSorry, I couldn't find an answer.",
    "confidence": 0.9,
    "meta": {
      "candidates": [
        [
          "qa",
          0.1
        ]
      ],
      "best_source": "qa"
    },
    "sources": {
      "qa": true
    }
  },
  "who wrote chander pahar": {
    "source": "Wikipedia",
    "text": "Chander Pahar (released as Mountains of the Moon in English) is a 2013 Indian Bengali-language action-adventure film based on Chander Pahar by Bengali novelist Bibhutibhushan Bandyopadhyay, directed by Kamaleshwar Mukherjee and produced by Mahendra Soni and Shrikant Mohta under the banner of their production house Shree Venkatesh Films. It features Bengali actor Dev in the lead role as Shankar. This is the first collaboration between Dev and Mukherjee, the latter having made only two films before: Uro Chithi and Meghe Dhaka Tara.It was dream project of Late Filmmaker Tarun Majumdar.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "where brazil is located": {
    "source": "Wikipedia",
    "text": "Brazil has a high level of urbanization with 87.8% of the population residing in urban and metropolitan areas. The criteria used by the IBGE (Brazilian Institute of Geography and Statistics) in determining whether households are urban or rural, however, are based on political divisions, not on the developed environment. Its most populous city is São Paulo.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "who is jesus christ": {
    "source": "Wikipedia",
    "text": "This is a partial list of notable people who have been claimed, either by themselves or by their followers, to be the reincarnation or incarnation of Jesus, or the Second Coming of Christ.\n\n\n== 17th century ==\n\nRhys Evans, (1607 – c.1660) who later renamed himself 'Arise Evans' was a Welsh prophet who travelled to London to spread his premonitions. He was arrested and imprisoned around 1650 at Newgate Prison for impersonating Christ.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "who was moses": {
    "source": "Wikipedia",
    "text": "In Abrahamic religions, Moses was the Hebrew prophet who led the Israelites out of slavery in the Exodus from Egypt. He is considered the most important prophet in Judaism and Samaritanism, and one of the most important prophets in Christianity, Islam, the Baháʼí Faith, and other Abrahamic religions. According to the Bible and Quran, God dictated the Mosaic Law to Moses, which he wrote down in the five books of the Torah.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "how many bones human has in their body": {
    "source": "Wikipedia",
    "text": "The human skeleton is the internal framework of the human body. It is composed of around 270 bones at birth – this total decreases to around 206 bones by adulthood after some bones get fused together. The bone mass in the skeleton makes up about 14% of the total body weight (ca.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "who is elon musk": {
    "source": "Wikipedia",
    "text": "Errol Graham Musk (born 25 May 1946) is a South African businessman, politician, and the patriarch of the Musk family. He was a member of Pretoria City Council from 1972 to 1983, and was a member of the Progressive Federal Party from 1980 to 1983 before resigning over political disagreements. As a businessman, he worked as a mechanical engineering consultant, developed properties, and invested in various ventures including emerald trading.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "who is donuld trump": {
    "source": "qa",
    "text": "Main Answer (Qa):\nDonald John Trump (born June 14, 1946) is an American politician, media personality, and businessman who is the 47th president of the United States. A member of the Republican Party, he served as the 45th president from 2017 to 2021.",
    "confidence": 0.9,
    "meta": {
      "candidates": [
        [
          "qa",
          0.8
        ]
      ],
      "best_source": "qa"
    },
    "sources": {
      "qa": true
    }
  },
  "7 7 what": {
    "source": "qa",
    "text": "Main Answer (Qa):\n6-7 (pronounced \"six seven\"; also written as 67, 6 7, and 6, 7) is an internet meme and slang term that emerged in early 2025 on TikTok and Instagram Reels. The phrase originated from the song \"Doot Doot (6 7)\" by Skrilla, which became popular in video edits featuring professional basketball players, especially LaMelo Ball, who is 6 ft 7 in (2.01 meters) tall.",
    "confidence": 0.9,
    "meta": {
      "candidates": [
        [
          "qa",
          0.8
        ]
      ],
      "best_source": "qa"
    },
    "sources": {
      "qa": true
    }
  },
  "who discovered gravity": {
    "source": "Wikipedia",
    "text": "In physics, gravity (from Latin  gravitas 'weight'), also known as gravitation or a gravitational interaction, is a fundamental interaction, which may be described as the effect of a field that is generated by a gravitational source such as mass.\nThe gravitational attraction between clouds of primordial hydrogen and clumps of dark matter in the early universe caused the hydrogen gas to coalesce, eventually condensing and fusing to form stars. At larger scales this resulted in galaxies and clusters, so gravity is a primary driver for the large-scale structures in the universe.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "what is the carbon cycle": {
    "source": "Wikipedia",
    "text": "The carbon cycle is a part of the biogeochemical cycle where carbon is exchanged among the biosphere, pedosphere, geosphere, hydrosphere, and atmosphere of Earth. Other major biogeochemical cycles include the nitrogen cycle and the water cycle. Carbon is the main component of biological compounds as well as a major component of many rocks such as limestone.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "what is the ozone layer": {
    "source": "Wikipedia",
    "text": "The ozone layer or ozone shield is a region of Earth's stratosphere that absorbs most of the Sun's ultraviolet radiation. It contains a high concentration of ozone (O3) in relation to other parts of the atmosphere, although still small in relation to other gases in the stratosphere. The ozone layer peaks at 8 to 15 parts per million of ozone, while the average ozone concentration in Earth's atmosphere as a whole is about 0.3 parts per million.",
    "confidence": 0.9,
    "meta": {},
    "sources": {
      "Wikipedia": true
    }
  },
  "operation sindoor": {
    "source": "qa",
    "text": "Main Answer (Qa):\nThe 2025 India–Pakistan conflict was a brief armed conflict between India and Pakistan that began on 7 May 2025, after India launched missile strikes on Pakistan, in a military campaign codenamed Operation Sindoor. India said that the operation was in response to the Pahalgam terrorist attack in Indian-administered Jammu and Kashmir on 22 April 2025 in which 26 civilians were killed.",
    "confidence": 0.9,
    "meta": {
      "candidates": [
        [
          "qa",
          0.8
        ]
      ],
      "best_source": "qa"
    },
    "sources": {
      "qa": true
    }
  }
}